In [9]:
import pandas as pd

In [69]:
df1 = pd.read_csv('./dataset/dim_date.csv')
df2 = pd.read_csv('./dataset/dim_districts.csv')
df3= pd.read_csv('./dataset/fact_stamps.csv')
df4 = pd.read_csv('./dataset/fact_transport.csv')
df5= pd.read_csv('./dataset/fact_TS_iPASS.csv')

# 1)Understanding the Data of Dim date table

In [27]:
df1.head()

        month  Mmm quarter  fiscal_year
0  2019-04-01  Apr      Q1         2019
1  2019-05-01  May      Q1         2019
2  2019-06-01  Jun      Q1         2019
3  2019-07-01  Jul      Q2         2019
4  2019-08-01  Aug      Q2         2019

In [28]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        48 non-null     object
 1   Mmm          48 non-null     object
 2   quarter      48 non-null     object
 3   fiscal_year  48 non-null     int64
dtypes: int64(1), object(3)
memory usage: 1.6+ KB

## This table contains the dates at the monthly level. Please be aware that the fiscal year of Telangana spans from April to March.

- month: This column contains the starting date of each month.

- Mmm: This column contains the name of the month.

- quarter: This column contains the associated quarter for each particular month.  

- fiscal_year: This column contains the corresponding fiscal year of each month.

### converting object type to datetime

In [29]:
df1['month'] = pd.to_datetime(df['month'])

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        48 non-null     datetime64[ns]
 1   Mmm          48 non-null     object
 2   quarter      48 non-null     object
 3   fiscal_year  48 non-null     int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 1.6+ KB

In [33]:
missing_values = df1.isnull().sum()
print(missing_values)

month          0
Mmm            0
quarter        0
fiscal_year    0
dtype: int64

In [34]:
df1.duplicated().sum()

0

# 2)Understanding the Data of Dim districts table

In [75]:
df2.head()

  dist_code              district
0      19_1              Adilabad
1      22_2  Bhadradri Kothagudem
2      21_1           Hanumakonda
3      16_1             Hyderabad
4      20_2               Jagtial

In [76]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   dist_code  33 non-null     object
 1   district   33 non-null     object
dtypes: object(2)
memory usage: 656.0+ bytes

# The table contains information about districts.

- dist_code: This column represents the district code or identifier for each district.

- district: This column represents the name of the district.

In [77]:
df2.isnull().sum()

dist_code    0
district     0
dtype: int64

In [78]:
df2.duplicated().sum()

0

# Understanding the Data of Dim stamps table

In [79]:
df3.head()

,dist_code,month,documents_registered_cnt,documents_registered_rev,estamps_challans_cnt,estamps_challans_rev
0,14_1,2019-04-01,4533,59236363,0,0
1,17_3,2019-04-01,4151,41508762,0,0
2,20_3,2019-04-01,2116,23674170,0,0
3,21_5,2019-04-01,1089,15915285,0,0
4,23_1,2019-04-01,6133,82593256,0,0

In [80]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1504 entries, 0 to 1503
Data columns (total 6 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   dist_code                 1504 non-null   object
 1   month                     1504 non-null   object
 2   documents_registered_cnt  1504 non-null   int64
 3   documents_registered_rev  1504 non-null   int64
 4   estamps_challans_cnt      1504 non-null   int64
 5   estamps_challans_rev      1504 non-null   int64
dtypes: int64(4), object(2)
memory usage: 70.6+ KB

# The table provides data on the revenue generated from document registrations and estamp challan payments aggregated at the district and monthly level.


- dist_code: This column represents the district code.

- month: This column represents the starting date of each month.

- documents_registered_cnt: This column represents the total count of documents registered.

- documents_registered_rev: This column represents the total revenue generated from the registered documents.

- estamps_challans_cnt: This column represents the count of e-stamps challans.

- estamps_challans_rev: This column represents the revenue generated from e-stamps challans.

In [71]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1504 entries, 0 to 1503
Data columns (total 6 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   dist_code                 1504 non-null   object
 1   month                     1504 non-null   object
 2   documents_registered_cnt  1504 non-null   int64
 3   documents_registered_rev  1504 non-null   int64
 4   estamps_challans_cnt      1504 non-null   int64
 5   estamps_challans_rev      1504 non-null   int64
dtypes: int64(4), object(2)
memory usage: 70.6+ KB

In [72]:
df3.isnull().sum()

dist_code                   0
month                       0
documents_registered_cnt    0
documents_registered_rev    0
estamps_challans_cnt        0
estamps_challans_rev        0
dtype: int64

In [73]:
df3.duplicated().sum()

0

# 4)Understanding the data of fact_TS_iPASS table

In [84]:
df4.head()

,dist_code,month,fuel_type_petrol,fuel_type_diesel,fuel_type_electric,fuel_type_others,vehicleClass_MotorCycle,vehicleClass_MotorCar,vehicleClass_AutoRickshaw,vehicleClass_Agriculture,vehicleClass_others,seatCapacity_1_to_3,seatCapacity_4_to_6,seatCapacity_above_6,Brand_new_vehicles,Pre-owned_vehicles,category_Non-Transport,category_Transport
0,15_1,2019-04-01,17910,3011,76,22,15308,4429,0,4,1278,16110,4182,717,19542,1477,19856,1163
1,18_2,2019-04-01,3066,306,6,0,2995,142,49,64,128,3156,189,33,3322,56,3203,175
2,20_3,2019-04-01,1577,215,0,0,1546,79,29,21,117,1683,104,5,1751,41,1648,144
3,21_3,2019-04-01,1961,281,2,0,1939,72,72,48,113,2082,146,16,2209,35,2075,169
4,21_7,2019-04-01,1552,309,0,0,1512,76,69,109,95,1696,145,20,1820,41,1701,160

In [81]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1440 entries, 0 to 1439
Data columns (total 18 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   dist_code                  1440 non-null   object
 1   month                      1440 non-null   object
 2   fuel_type_petrol           1440 non-null   int64
 3   fuel_type_diesel           1440 non-null   int64
 4   fuel_type_electric         1440 non-null   int64
 5   fuel_type_others           1440 non-null   int64
 6   vehicleClass_MotorCycle    1440 non-null   int64
 7   vehicleClass_MotorCar      1440 non-null   int64
 8   vehicleClass_AutoRickshaw  1440 non-null   int64
 9   vehicleClass_Agriculture   1440 non-null   int64
 10  vehicleClass_others        1440 non-null   int64
 11  seatCapacity_1_to_3        1440 non-null   int64
 12  seatCapacity_4_to_6        1440 non-null   int64
 13  seatCapacity_above_6       1440 non-null   int64
 14  Brand_new_vehicles         1440 non-null   int64
 15  Pre-owned_vehicles         1440 non-null   int64
 16  category_Non-Transport     1440 non-null   int64
 17  category_Transport         1440 non-null   int64
dtypes: int64(16), object(2)
memory usage: 202.6+ KB

# The table provides information about the individual vehicle sales data from the RTA(Regional Transport Authority) of the state of Telangana categorized by fuel type,
vehicle class, seating capacity, and other general categories aggregated at the district and monthly level.

- dist_code: This column represents the district code.

- month: This column represents the starting date of each month.

- Vehicle sales categorized by different fuel types:
	fuel_type_petrol: Number of vehicles sold with petrol fuel type.
	fuel_type_diesel: Number of vehicles sold with diesel fuel type.
	fuel_type_electric: Number of vehicles sold with electric fuel type.
	fuel_type_others: Number of vehicles sold with other fuel types.

- Vehicle sales categorized by different vehicle class:
	vehicleClass_Motorcycles: This category includes all two-wheeled vehicles, such as motorcycles, scooters etc.
	vehicleClass_Motorcars: This category includes all four-wheeled vehicles, such as cars, vans etc.
	vehicleClass_Auto rickshaws: This category includes three-wheeled vehicles, such as auto rickshaws.
	vehicleClass_Agriculture: This category includes all vehicles used for agricultural purposes, such as tractors and harvesters.
	vehicleClass_Others: This category includes all vehicles belonging to other classes.

- Vehicle sales categorized by seating capacity
	seatCapacity_1_to_3: Number of vehicles sold with a seating capacity ranging from 1 to 3.
	seatCapacity_4_to_6: Number of vehicles sold with a seating capacity ranging from 4 to 6.
	seatCapacity_above_6: Number of vehicles sold with a seating capacity above 6.

- Sales of vehicles by other categories:
	Brand_new_vehicles: Number of brand new vehicles sold.
	Pre-owned_vehicles: Number of pre-owned vehicles sold.
	category_Non-Transport: Number of vehicles in the non-transport category sold. The Non-Transport category typically includes vehicles that are not primarily used for public transportation of passengers or goods. Instead, these vehicles are generally intended for personal use, recreational activities, agriculture, construction, and other non-commercial purposes.
	category_Transport: Number of vehicles in the transport category sold. The Transport category comprises vehicles primarily designed and used for the transportation of goods, passengers, or both. These vehicles are generally associated with commercial and public transportation purposes.

In [82]:
df4.isnull().sum()

dist_code                    0
month                        0
fuel_type_petrol             0
fuel_type_diesel             0
fuel_type_electric           0
fuel_type_others             0
vehicleClass_MotorCycle      0
vehicleClass_MotorCar        0
vehicleClass_AutoRickshaw    0
vehicleClass_Agriculture     0
vehicleClass_others          0
seatCapacity_1_to_3          0
seatCapacity_4_to_6          0
seatCapacity_above_6         0
Brand_new_vehicles           0
Pre-owned_vehicles           0
category_Non-Transport       0
category_Transport           0
dtype: int64

In [83]:
df4.duplicated().sum()

0

# Understanding the data of fact_TS_ipa Table

In [85]:
df5.head()

,dist_code,month,sector,investment in cr,number_of_employees
0,14_1,01-04-2019,Engineering,2.3200,15
1,19_1,01-04-2019,Engineering,0.6250,13
2,20_3,01-04-2019,Wood and Leather,0.2000,8
3,20_3,01-04-2019,Textiles,0.2675,27
4,21_5,01-04-2019,Electrical and Electronic Products,0.1200,5

# The TS-iPASS dataset in Telangana comprises data concerning units or businesses established within the state under the "Industrial Project Approval and Self-Certification System" (iPASS). This government initiative aims to foster industrial growth and investment by streamlining project approvals and enabling self-certification for businesses.
For further details, visit: https://ipass.telangana.gov.in/


- dist_code: This column represents the district code.

- month: This column represents the starting date of each month.

- sector: This column represents the industry category. Examples of sectors include 'Automobiles', 'Beverages', 'Engineering', 'Food Processing', etc.

- investment in cr: The column represents the investment made in the specific sector, measured in crores (a unit of currency), for the corresponding district and month.

- number_of_employes: This column represents the number of employees associated with that sector for given district and respective month.

In [88]:
df5.isnull().sum()

dist_code              0
month                  0
sector                 0
investment in cr       0
number_of_employees    0
dtype: int64

In [90]:
df5.duplicated().sum()

0